README.org
#+TITLE: README
#+AUTHOR: K Gopal Krishna
#+PROPERTY: header-args :cache yes :mkdirp yes

* Bootstrap
#+BEGIN_SRC sh :tangle dot :shebang "#!/usr/bin/env bash"
  # import sanity
  set -euo pipefail

  # global declarations
  SCRIPT_PATH=$(dirname $(realpath "$0"))
  ZSH="${HOME}/.config/omz"
  ZSH_CUSTOM="${HOME}/.config/omz/custom"

  update() {
      case "${1}" in
          "desktop")
              updateDesktop
              ;;
          "doom"|"emacs")
              updateEmacs
              ;;
          "firefox")
              updateFirefox
              ;;
          "plasma")
              updatePlasma
              ;;
          "systemd")
              updateSystemd
              ;;
          "thunderbird")
              updateThunderbird
              ;;
          "chromium")
              updateChromium
              ;;
          "utilsh")
              updateUtilsh
              ;;
          "zsh")
              updateZSH
              ;;
      esac
  }

  updateDesktop() {
      ln -sf "${SCRIPT_PATH}"/.local/share/applications/*.desktop "${HOME}"/.local/share/applications/
  }

  updateEmacs() {
      ln -sf "${SCRIPT_PATH}"/.config/doom/* "${HOME}"/.config/doom/
      "${HOME}"/.emacs.d/bin/doom refresh
  }

  updateFirefox() {
      source "${SCRIPT_PATH}"/.mozilla/firefox/bootstrap.sh

      applyPolicies
      applyProfilesINI
      updateUserJS
      applyUserJS
      cleanUp
  }

  updatePlasma() {
      ln -sf "${SCRIPT_PATH}"/.config/autostart-scripts/*.sh "${HOME}"/.config/autostart-scripts/
      ln -sf "${SCRIPT_PATH}"/.config/plasma-workspace/env/*.sh "${HOME}"/.config/plasma-workspace/env/
      ln -sf "${SCRIPT_PATH}"/.pam_environment "${HOME}"/
  }

  updateSystemd() {
      ln -sf "${SCRIPT_PATH}"/.config/systemd/user/*.service "${HOME}"/.config/systemd/user/

      for service in $(ls -1 "${HOME}/.config/systemd/user" | cut -d '.' -f1); do
          systemctl --user enable --now "${service}"
      done
  }

  updateThunderbird() {
      ln -sf "${SCRIPT_PATH}"/.thunderbird/profiles.ini "${HOME}"/.thunderbird/
  }

  updateVSCodium() {
      ln -sf "${SCRIPT_PATH}"/.config/VSCodium/User/*.json "${HOME}"/.config/VSCodium/User/
  }

  updateChromium() {
      ln -sf "${SCRIPT_PATH}"/.config/chromium-flags.conf "${HOME}"/.config/
  }

  updateUtilsh() {
      ln -sf "${SCRIPT_PATH}"/.local/bin/* "${HOME}"/.local/bin/
  }

  updateZSH() {
      if [[ ! -d "${ZSH_CUSTOM}"/plugins/zsh-syntax-highlighting ]]; then
          git clone https://github.com/zsh-users/zsh-syntax-highlighting.git "${ZSH_CUSTOM:-~/.oh-my-zsh/custom}"/plugins/zsh-syntax-highlighting
      fi

      if [[ ! -d "${ZSH_CUSTOM}"/plugins/zsh-autosuggestions ]]; then
          git clone https://github.com/zsh-users/zsh-autosuggestions "${ZSH_CUSTOM:-~/.oh-my-zsh/custom}"/plugins/zsh-autosuggestions
      fi

      ln -sf "${SCRIPT_PATH}"/.zshrc "${HOME}"/
  }

  setup() {
      case "${1}" in
          "desktop")
              setupDesktop
              ;;
          "doom"|"emacs")
              setupEmacs
              ;;
          "firefox")
              setupFirefox
              ;;
          "plasma")
              setupPlasma
              ;;
          "systemd")
              setupSystemd
              ;;
          "thunderbird")
              setupThunderbird
              ;;
          "chromium")
              setupChromium
              ;;
          "utilsh")
              setupUtilsh
              ;;
          "zsh")
              setupZSH
              ;;
      esac
  }

  setupDesktop() {
      mkdir -p "${HOME}"/.local/share/applications
      updateDesktop
  }

  setupEmacs() {
      echo -e "Creating doom emacs directory..."
      if mkdir -p "${HOME}"/.config/doom; then
          printf '\u2714\n'
      else
          printf '\u274c\n'
      fi

      echo -ne "Cloning doom emacs source..."
      if git clone https://github.com/hlissner/doom-emacs ~/.emacs.d; then
          printf '\u2714\n'
      else
          printf '\u274c\n'
      fi

      echo -e "Unleashing doom..."
      "${HOME}"/.emacs.d/bin/doom install

      updateEmacs
  }

  setupFirefox() {
      source "${SCRIPT_PATH}"/.mozilla/firefox/bootstrap.sh

      applyPolicies
      createProfilesINIDir
      applyProfilesINI
      createProfiles
      updateUserJS
      applyUserJS
      cleanUp
      startFirefox
  }

  setupPlasma() {
      updatePlasma
  }

  setupSystemd() {
      mkdir -p "${HOME}/.config/systemd/user"
  }

  setupThunderbird() {
      mkdir -p "${HOME}"/.config/thunderbird/primary
      updateThunderbird
  }

  setupVSCodium() {
      updateVSCodium
  }

  setupChromium() {
      updateChromium
  }

  setupUtilsh() {
      updateUtilsh
  }

  setupZSH() {
      if [[ ! upgrade_oh_my_zsh || ! -d "${HOME}/.oh-my-zsh" ]]; then
          export ZSH="${HOME}/.config/omz"
          sh -c "$(curl -fsSL https://raw.github.com/robbyrussell/oh-my-zsh/master/tools/install.sh)"
      else
          exit 1
      fi
  }

  addToPath() {
      echo -e "Adding this program to \$PATH so that it is globally available."
      mkdir -p "${HOME}"/.local/bin
      ln -sf "${SCRIPT_PATH}"/dot "${HOME}"/.local/bin/
  }

  refresh() {
      git --git-dir="${SCRIPT_PATH}/.git" --work-tree="${SCRIPT_PATH}" pull
  }

  main() {
      case "${1}" in
          "setup")
              setup "${2}"
              ;;
          "update")
              update "${2}"
              ;;
          "set")
              addToPath
              ;;
          "refresh")
              refresh
              ;;
          ,*)
              echo -e "Invalid option."
              ;;
      esac
  }

  main "${@}"
#+END_SRC
* Autostart
** Scripts
*** SSH
#+BEGIN_SRC sh :tangle .config/autostart-scripts/ssh-add.sh :shebang "#!/usr/bin/env bash"
  # Enable extended globbing
  shopt -s extglob dotglob nullglob

  # Add all files in $HOME/.ssh/keys that do not end
  # with .pub
  ssh-add "${HOME}"/.ssh/keys/!(*.pub) </dev/null
#+END_SRC
* Desktop
** Deezer
#+BEGIN_SRC conf :tangle .local/share/applications/deezer.desktop :shebang "#!/usr/bin/env xdg-open"
  [Desktop Entry]
  Name=Deezer
  StartupNotify=true
  Icon=/home/kayg/Pictures/Icons/deezer.svg
  Comment=Deezer audio streaming service
  Exec=chromium --user-data-dir=${HOME}/.config/chromium/Apps --app=https://www.deezer.com/
  Terminal=false
  Type=Application
  MimeType=x-scheme-handler/deezer;
  StartupWMClass=deezer
  Categories=Audio;Music;Player;AudioVideo;
#+END_SRC
** Invidious
#+BEGIN_SRC conf :tangle .local/share/applications/invidious.desktop :shebang "#!/usr/bin/env xdg-open"
  [Desktop Entry]
  Name=Invidious
  StartupNotify=true
  Icon=/home/kayg/Pictures/Icons/youtube.png
  Comment=Most popular video streaming platform
  Exec=chromium --user-data-dir=${HOME}/.config/chromium/Apps --app=https://tube.kayg.org/
  Terminal=false
  Type=Application
  MimeType=x-scheme-handler/youtube;
  StartupWMClass=invidious
  Categories=Audio;Music;Player;AudioVideo;
#+END_SRC
