README.md

# Table of Contents

1.  [Bootstrap](#org505da0d)
2.  [Autostart](#org43b9410)
    1.  [Scripts](#org2f27658)
        1.  [SSH](#org8031245)
3.  [Desktop](#org94efb4a)
    1.  [Deezer](#orgd7a116a)
    2.  [Invidious](#org3c85405)
    3.  [Riot](#org0cdec8c)
    4.  [Saavn](#org5debceb)
    5.  [Slack](#orga3bc417)
    6.  [Wire](#org945595b)
4.  [Emacs](#orgd641ef6)
    1.  [Init](#org0821607)
    2.  [Config](#org1f9580d)
    3.  [Packages](#org3309f6e)
5.  [Firefox](#orgebd69bd)
    1.  [Profiles](#org9504487)
    2.  [Policies](#org033a246)
    3.  [UserJS](#orgf931d36)
        1.  [General](#orgc9e5d77)
        2.  [Themes](#orgef78ad4)
    4.  [Setup](#org445ba0a)
6.  [Plasma](#org22e9525)
    1.  [Environment](#orga8747d9)
    2.  [PAM](#orga189ce3)
7.  [Systemd](#org030e82e)
    1.  [SSH Agent](#org5886e55)
8.  [Thunderbird](#org47495bf)
    1.  [Profiles](#org5917cd6)
9.  [Ungoogled Chromium](#org01bf93d)
    1.  [Environment Variables](#org7de3760)
    2.  [Flags](#orgc08d6b4)
10. [Utility](#org98da626)
    1.  [Ungoogled Chromium Extension Updater](#org871cbff)
    2.  [Virtual Desktop Bar (KDE)](#org250a418)
    3.  [KWin Tiling Script (Faho)](#org716ddc3)
    4.  [Wallpaper Index](#org8f623ea)
11. [VSCodium](#org6833df4)
    1.  [Settings](#orgc24b44b)
    2.  [Keybindings](#org052b34c)
12. [ZSH](#org6377dc4)
    1.  [Oh-my-zsh stuff](#org157a4fd)
    2.  [Functions](#orge74c8bf)
        1.  [Weather](#orgca3e255)
    3.  [Variables](#org2b91caa)
    4.  [Aliases](#org177be42)



<a id="org505da0d"></a>

# Bootstrap

    # import sanity
    set -euo pipefail
    
    # global declarations
    SCRIPT_PATH=$(dirname $(realpath "$0"))
    ZSH="${HOME}/.config/omz"
    ZSH_CUSTOM="${HOME}/.config/omz/custom"
    
    update() {
        case "${1}" in
            "desktop")
                updateDesktop
                ;;
            "doom"|"emacs")
                updateEmacs
                ;;
            "firefox")
                updateFirefox
                ;;
            "plasma")
                updatePlasma
                ;;
            "systemd")
                updateSystemd
                ;;
            "thunderbird")
                updateThunderbird
                ;;
            "chromium")
                updateChromium
                ;;
            "utilsh")
                updateUtilsh
                ;;
            "zsh")
                updateZSH
                ;;
        esac
    }
    
    updateDesktop() {
        ln -sf "${SCRIPT_PATH}"/.local/share/applications/*.desktop "${HOME}"/.local/share/applications/
    }
    
    updateEmacs() {
        ln -sf "${SCRIPT_PATH}"/.config/doom/* "${HOME}"/.config/doom/
        "${HOME}"/.emacs.d/bin/doom refresh
    }
    
    updateFirefox() {
        source "${SCRIPT_PATH}"/.mozilla/firefox/bootstrap.sh
    
        applyPolicies
        applyProfilesINI
        updateUserJS
        applyUserJS
        cleanUp
    }
    
    updatePlasma() {
        ln -sf "${SCRIPT_PATH}"/.config/autostart-scripts/*.sh "${HOME}"/.config/autostart-scripts/
        ln -sf "${SCRIPT_PATH}"/.config/plasma-workspace/env/*.sh "${HOME}"/.config/plasma-workspace/env/
        ln -sf "${SCRIPT_PATH}"/.pam_environment "${HOME}"/
    }
    
    updateSystemd() {
        ln -sf "${SCRIPT_PATH}"/.config/systemd/user/*.service "${HOME}"/.config/systemd/user/
    
        for service in $(ls -1 "${HOME}/.config/systemd/user" | cut -d '.' -f1); do
            systemctl --user enable --now "${service}"
        done
    }
    
    updateThunderbird() {
        ln -sf "${SCRIPT_PATH}"/.thunderbird/profiles.ini "${HOME}"/.thunderbird/
    }
    
    updateVSCodium() {
        ln -sf "${SCRIPT_PATH}"/.config/VSCodium/User/*.json "${HOME}"/.config/VSCodium/User/
    }
    
    updateChromium() {
        ln -sf "${SCRIPT_PATH}"/.config/chromium-flags.conf "${HOME}"/.config/
    }
    
    updateUtilsh() {
        ln -sf "${SCRIPT_PATH}"/.local/bin/* "${HOME}"/.local/bin/
    }
    
    updateZSH() {
        if [[ ! -d "${ZSH_CUSTOM}"/plugins/zsh-syntax-highlighting ]]; then
            git clone https://github.com/zsh-users/zsh-syntax-highlighting.git "${ZSH_CUSTOM:-~/.oh-my-zsh/custom}"/plugins/zsh-syntax-highlighting
        fi
    
        if [[ ! -d "${ZSH_CUSTOM}"/plugins/zsh-autosuggestions ]]; then
            git clone https://github.com/zsh-users/zsh-autosuggestions "${ZSH_CUSTOM:-~/.oh-my-zsh/custom}"/plugins/zsh-autosuggestions
        fi
    
        ln -sf "${SCRIPT_PATH}"/.zshrc "${HOME}"/
    }
    
    setup() {
        case "${1}" in
            "desktop")
                setupDesktop
                ;;
            "doom"|"emacs")
                setupEmacs
                ;;
            "firefox")
                setupFirefox
                ;;
            "plasma")
                setupPlasma
                ;;
            "systemd")
                setupSystemd
                ;;
            "thunderbird")
                setupThunderbird
                ;;
            "chromium")
                setupChromium
                ;;
            "utilsh")
                setupUtilsh
                ;;
            "zsh")
                setupZSH
                ;;
        esac
    }
    
    setupDesktop() {
        mkdir -p "${HOME}"/.local/share/applications
        updateDesktop
    }
    
    setupEmacs() {
        echo -e "Creating doom emacs directory..."
        if mkdir -p "${HOME}"/.config/doom; then
            printf '\u2714\n'
        else
            printf '\u274c\n'
        fi
    
        echo -ne "Cloning doom emacs source..."
        if git clone https://github.com/hlissner/doom-emacs ~/.emacs.d; then
            printf '\u2714\n'
        else
            printf '\u274c\n'
        fi
    
        echo -e "Unleashing doom..."
        "${HOME}"/.emacs.d/bin/doom install
    
        updateEmacs
    }
    
    setupFirefox() {
        source "${SCRIPT_PATH}"/.mozilla/firefox/bootstrap.sh
    
        applyPolicies
        createProfilesINIDir
        applyProfilesINI
        createProfiles
        updateUserJS
        applyUserJS
        cleanUp
        startFirefox
    }
    
    setupPlasma() {
        updatePlasma
    }
    
    setupSystemd() {
        mkdir -p "${HOME}/.config/systemd/user"
    }
    
    setupThunderbird() {
        mkdir -p "${HOME}"/.config/thunderbird/primary
        updateThunderbird
    }
    
    setupVSCodium() {
        updateVSCodium
    }
    
    setupChromium() {
        updateChromium
    }
    
    setupUtilsh() {
        updateUtilsh
    }
    
    setupZSH() {
        if [[ ! upgrade_oh_my_zsh || ! -d "${HOME}/.oh-my-zsh" ]]; then
            export ZSH="${HOME}/.config/omz"
            sh -c "$(curl -fsSL https://raw.github.com/robbyrussell/oh-my-zsh/master/tools/install.sh)"
        else
            exit 1
        fi
    }
    
    addToPath() {
        echo -e "Adding this program to \$PATH so that it is globally available."
        mkdir -p "${HOME}"/.local/bin
        ln -sf "${SCRIPT_PATH}"/dot "${HOME}"/.local/bin/
    }
    
    refresh() {
        git --git-dir="${SCRIPT_PATH}/.git" --work-tree="${SCRIPT_PATH}" pull
    }
    
    main() {
        case "${1}" in
            "setup")
                setup "${2}"
                ;;
            "update")
                update "${2}"
                ;;
            "set")
                addToPath
                ;;
            "refresh")
                refresh
                ;;
            *)
                echo -e "Invalid option."
                ;;
        esac
    }
    
    main "${@}"


<a id="org43b9410"></a>

# Autostart


<a id="org2f27658"></a>

## Scripts


<a id="org8031245"></a>

### SSH

    # Enable extended globbing
    shopt -s extglob dotglob nullglob
    
    # Add all files in $HOME/.ssh/keys that do not end
    # with .pub
    ssh-add "${HOME}"/.ssh/keys/!(*.pub) </dev/null


<a id="org94efb4a"></a>

# Desktop


<a id="orgd7a116a"></a>

## Deezer

    [Desktop Entry]
    Name=Deezer
    StartupNotify=true
    Icon=/home/kayg/Pictures/Icons/deezer.svg
    Comment=Deezer audio streaming service
    Exec=chromium --user-data-dir=${HOME}/.config/chromium/Apps --app=https://www.deezer.com/
    Terminal=false
    Type=Application
    MimeType=x-scheme-handler/deezer;
    StartupWMClass=deezer
    Categories=Audio;Music;Player;AudioVideo;


<a id="org3c85405"></a>

## Invidious

    [Desktop Entry]
    Name=Invidious
    StartupNotify=true
    Icon=/home/kayg/Pictures/Icons/youtube.png
    Comment=Most popular video streaming platform
    Exec=chromium --user-data-dir=${HOME}/.config/chromium/Apps --app=https://tube.kayg.org/
    Terminal=false
    Type=Application
    MimeType=x-scheme-handler/youtube;
    StartupWMClass=invidious
    Categories=Audio;Music;Player;AudioVideo;
