README.md


<a id="org0cdec8c"></a>

## Riot

    [Desktop Entry]
    Name=Riot
    Comment=A feature-rich client for Matrix.org
    Exec=chromium --user-data-dir=${HOME}/.config/chromium/Apps --app=https://riot.im/app/
    Terminal=false
    Type=Application
    Icon=/home/kayg/Pictures/Icons/riot.png
    StartupWMClass="Riot"
    Categories=Network;InstantMessaging;Chat;IRCClient


<a id="org5debceb"></a>

## Saavn

    [Desktop Entry]
    Name=Saavn
    StartupNotify=true
    Icon=/home/kayg/Pictures/Icons/jiosaavn.png
    Comment=Saavn audio streaming service
    Exec=chromium --user-data-dir=${HOME}/.config/chromium/Apps --app=https://www.jiosaavn.com/
    Terminal=false
    Type=Application
    MimeType=x-scheme-handler/saavn;
    StartupWMClass=saavn
    Categories=Audio;Music;Player;AudioVideo;


<a id="orga3bc417"></a>

## Slack

    [Desktop Entry]
    Name=Slack
    StartupWMClass=Slack
    Comment=Where work happens
    GenericName=Slack Desktop
    Exec=chromium --user-data-dir=${HOME}/.config/chromium/Apps --app=https://iiit-bhcoding.slack.com/
    Icon=slack
    Terminal=false
    Type=Application
    MimeType=x-scheme-handler/slack;
    StartupNotify=true
    Categories=GNOME;GTK;Network;InstantMessaging;


<a id="org945595b"></a>

## Wire

    [Desktop Entry]
    Name=Wire
    Comment=The most secure collaboration platform.
    Exec=chromium --user-data-dir=$HOME/.config/chromium/Apps --app=https://app.wire.com
    Terminal=false
    Type=Application
    Icon=/home/kayg/Pictures/Icons/wire.png
    StartupWMClass=Wire
    Categories=Network;
    GenericName=Secure messenger
    Keywords=chat;encrypt;e2e;messenger;videocall
    MimeType=x-scheme-handler/wire
    Version=1.1


<a id="orgd641ef6"></a>

# Emacs

After an year of configuring Emacs, I have somehow reached
exactly at a point which mimics the style and philosophy of
Doom Emacs without realizing it. Although my configuration
was, at heart, a doomacs; in performance and functionality,
it lagged behind by a significant margin.

I have found myself frustrated by the fact that I have to
bake in functionality of every kind when I&rsquo;m in *need* of
that particular functionality, and hence, a lot of time was
spent in adding functionality rather than being creative or
productive. My first train of thought was to try something
which abstracted all of this functionality into a single
click &#x2013; something like VSCodium &#x2013; but the problem with
that particular editor is it isn&rsquo;t particularly hackable.
Apart from a hundred or so rants about how lacking VSCodium
is to my pal [Anwes](https://pandacowbat.com), one particular thing that irked me a lot
was the incessant need to reach for the mouse for something
or the other. I would have to change the whole keyboard
shortcuts layout to customize it to my needs and what was
worse is that I would have to remember two of those layouts
&#x2013; one which worked with the vim emulation and one which
worked with native VSCodium &#x2013; and the latter doesn&rsquo;t even
support three key chord bindings at the time of writing
this.

What VSCodium excels at, though, is the autocompletion,
intellisense, *almost* baked-in like support for linting,
checking, debugging. LSP is a first class citizen in
VSCodium and VSCodium is the first (and perhaps the only?)
editor that LSP is tested on. All of this makes LSP on
something like Emacs a slow, tedious hog; adding further
disappointment given the time taken to configure it.

The solution &#x2013; or perhaps &#x2013; the best balance that I could
find was in ****doom**** (pun intended). Doom Emacs (for now, at
least) seems to do everything I need, OOTB; has a
trouble-free way of adding language support. So I am
throwing away (or refactoring?) my 1 year-in-the-making
configuration of Emacs to find my peace in doom.
