README.org
** Config
- Set theme
- Do not preserve indentation while tangling code blocks.
- Set font
#+BEGIN_SRC emacs-lisp :tangle .config/doom/config.el
  (setq doom-theme 'doom-molokai)
  (after! org
    (setq org-src-preserve-indentation nil))
  (setq treemacs-width 25)

  (setq doom-font (font-spec :family "IBM Plex Mono" :size 26 :weight 'semi-bold)
        doom-variable-pitch-font (font-spec :family "Fira Sans") ; inherits `doom-font''s :size
        doom-unicode-font (font-spec :family "Input Mono Narrow" :size 26)
        doom-big-font (font-spec :family "IBM Plex Mono" :size 40 :weight 'semi-bold))
#+END_SRC
** Packages
Add extra packages
#+BEGIN_SRC emacs-lisp :tangle .config/doom/packages.el
  (package! caddyfile-mode)
  (package! command-log-mode)
  (package! docker-compose-mode)
#+END_SRC
* Firefox
** Profiles
- =StartWithLastProfile= ensures a profile choice isn't
  asked at startup.

Sometimes Firefox amazes me by how customizable it is. I
have +two+ three profiles with Firefox; one for browsing,
one for /research/ and one for web applications. Since a lot
of my research gets lost and I'm unable to refer to previous
findings, it helps to have a separate profile. All profiles
are stored in a standardized XDG configuration directory
(=~/.config/firefox=) rather than the default
(=~/.mozilla/firefox/=). I would also rather name my own
profiles than let firefox name them randomly.

+I tried running Electron Apps with it but sadly, things+
+like pasting images from clipboard and downloading files+
+from Skype (yes, my workplace uses *Skype* in 2019, *groan*)+
+do not work. Hence I now rely on Ungoogled Chromium to do my+
+dirty work.+

+I tried using ungoogled chromium for dirty web apps but+
+recently, on Arch Linux, =libjsoncpp= got an update and+
+broke chromium which isn't as regularly built as the+
+upstream binaries. So though, clipboard interaction was a+
+sweet feature to have, I can let it go for relatively good+
+stability.+

Ungoogled Chromium works again!

Although things work fine with UC, I'm unsure if Chromium
profiles actually provide a /temporary-container/ sort of
isolation. I say this because tabs on different profiles
show up as normal tabs in the task manager which would mean
that an application running on one profile is externally
aware. Please correct me on this if you have more
information. I also miss the declarative configuration that
Firefox offers as I reinstall often.
#+BEGIN_SRC ini :tangle .mozilla/firefox/profiles.ini
  [General]
  StartWithLastProfile=1

  [Profile0]
  Name=Browse
  IsRelative=1
  Path=../../.config/firefox/browse
  Default=1

  [Profile1]
  Name=Research
  IsRelative=1
  Path=../../.config/firefox/research
  Default=0
#+END_SRC
** Policies
Mozilla's Policies' explanation can be found [[https://github.com/mozilla/policy-templates/blob/master/README.md][here]].
#+BEGIN_SRC json :tangle .mozilla/firefox/policies.json
  {
    "policies": {
      "CaptivePortal": true,
      "Cookies": {
        "Default": true,
        "AcceptThirdParty": "never",
        "ExpireAtSessionEnd": true
      },
      "DisableAppUpdate": false,
      "DisableDeveloperTools": false,
      "DisableFeedbackCommands": true,
      "DisableFirefoxAccounts": false,
      "DisableFirefoxScreenshots": true,
      "DisableFirefoxStudies": true,
      "DisableMasterPasswordCreation": true,
      "DisablePocket": true,
      "DisableProfileImport": false,
      "DisableSetDesktopBackground": false,
      "DisableSystemAddonUpdate": true,
      "DisableTelemetry": true,
      "DNSOverHTTPS": {
        "Enabled": true,
        "ProviderURL": "https://dns.quad9.net/dns-query",
        "Locked": false
      },
      "Extensions": {
        "Install": [
                     "https://addons.mozilla.org/firefox/downloads/latest/bitwarden-password-manager/latest.xpi",
                     "https://addons.mozilla.org/firefox/downloads/latest/canvasblocker/latest.xpi",
                     "https://addons.mozilla.org/firefox/downloads/latest/clearurls/latest.xpi",
                     "https://addons.mozilla.org/firefox/downloads/latest/decentraleyes/latest.xpi",
                     "https://addons.mozilla.org/firefox/downloads/latest/httpz/latest.xpi",
                     "https://addons.mozilla.org/firefox/downloads/latest/invidition/latest.xpi",
                     "https://addons.mozilla.org/firefox/downloads/latest/multi-account-containers/latest.xpi",
                     "https://addons.mozilla.org/firefox/downloads/latest/peertubeify/latest.xpi",
                     "https://addons.mozilla.org/firefox/downloads/latest/temporary-containers/latest.xpi",
                     "https://addons.mozilla.org/firefox/downloads/latest/ublock-origin/latest.xpi",
                     "https://addons.mozilla.org/firefox/downloads/latest/umatrix/latest.xpi",
                     "https://addons.mozilla.org/firefox/downloads/latest/user-agent-string-switcher/latest.xpi"
                   ],
        "Uninstall": [
                       "amazondotcom@search.mozilla.org",
                       "bing@search.mozilla.org",
                       "ebay@search.mozilla.org",
                       "google@search.mozilla.org",
                       "twitter@search.mozilla.org"
                 ],
        "Locked":  [""]
      },
      "ExtensionUpdate": true,
      "HardwareAcceleration": true,
      "NetworkPrediction": false,
      "NoDefaultBookmarks": true,
      "OfferToSaveLogins": false,
      "SanitizeOnShutdown": {
          "Cache": true,
          "Cookies": false,
          "Downloads": false,
          "FormData": false,
          "History": false,
          "Sessions": true,
          "SiteSettings": false,
          "OfflineApps": true
      },
      "SearchBar": "unified",
      "SSLVersionMin": "tls1.2"
    }
  }
#+END_SRC
** UserJS
*** General
I use GHacks' UserJS which I think is an excellent beginner
point towards making your own customizations as it allows
you to focus on tweaking for usablity from an already
privacy-centered configuration.
#+BEGIN_SRC js :tangle .mozilla/firefox/user-overrides.js
  /// GPU Acceleration ///

  // Force enable hardware acceleration
  user_pref("layers.acceleration.force-enabled", true);
  // WebRender is automatically disabled for screens < 4K
  user_pref("gfx.webrender.all", true);
  // Enable accelerated azure canvas
  user_pref("gfx.canvas.azure.accelerated", true);

  /// GPU Acceleration ///

  /// Storage ///

  // Do caching in RAM instead of disk
  user_pref("browser.cache.disk.enable", false);
  user_pref("browser.cache.memory.enable", true);

  // Save session data every 5 minutes instead of every 15 seconds
  user_pref("browser.sessionstore.interval", 300000);

  /// Storage ///

  /// Search ///

  // Search via address bar
  user_pref("keyword.enabled", true);

  // Enable suggestion of searches; safe since I use SearX
  user_pref("browser.search.suggest.enabled", true);
  user_pref("browser.urlbar.suggest.searches", true);

  /// Search ///


  /// Misc ///

  // Disable letterboxing
  user_pref("privacy.resistFingerprinting.letterboxing", false);

  // Enable WebAssembly
  user_pref("javascript.options.wasm", true);

  /// Misc ///
#+END_SRC
*** Themes
**** MaterialFox
#+BEGIN_SRC js :tangle .mozilla/firefox/materialfox.js
  /// MaterialFox ///

  user_pref("toolkit.legacyUserProfileCustomizations.stylesheets", true);
  user_pref("svg.context-properties.content.enabled", true);
  user_pref("browser.tabs.tabClipWidth", 83);
  user_pref("materialFox.reduceTabOverflow", true);
  user_pref("security.insecure_connection_text.enabled", true);

  /// MaterialFox ///
#+END_SRC
