README.org
**** GNOME
#+BEGIN_SRC js :tangle .mozilla/firefox/gnome.js
  /// GNOME ///

  /* user.js
   ,* https://github.com/rafaelmardojai/firefox-gnome-theme/
   ,*/

  // Enable customChrome.css
  user_pref("toolkit.legacyUserProfileCustomizations.stylesheets", true);

  // Enable CSD
  user_pref("browser.tabs.drawInTitlebar", true);

  // Set UI density to normal
  user_pref("browser.uidensity", 0);

  /// GNOME ///
#+END_SRC
** Setup
Functions:
- =createWorkDir=: checks if the work directory already
  exists, removes it if it does exist (which it will, in
  case non-zero termination of the script), to start afresh.
- =fetchGHacksJS=: fetches the source from upstream and
  navigates into the folder
- =mkTweaks=: makes the custom user.js tweaks according to the
  option passed. Currently, supported themes are /MaterialFox/
  and /GNOME/.
- =applyToProfiles=: reads =profiles.ini= and creates the
  specified profiles, thereafter copying the modified
  user.js files into those profiles.
- =cleanUp=: removes the created work directory.

This script sets up my firefox profiles and custom userJS that
builds upon the GHacksUserJS.
#+BEGIN_SRC sh :tangle .mozilla/firefox/setup.sh
  #!/usr/bin/env bash

  # import sanity
  set -euo pipefail

  # global declarations
  SCRIPT_PATH=$(dirname $(realpath "${BASH_SOURCE}"))

  mkWorkDir() {
      if [[ -d "${SCRIPT_PATH}"/workdir ]]; then
          rm -rf "${SCRIPT_PATH}"/workdir
      fi

      echo "Creating Work Directory..."
      mkdir -p "${SCRIPT_PATH}"/workdir
  }

  fetchGHacksJS() {
      echo "Fetching ghacks user.js..."
      git clone https://github.com/ghacksuserjs/ghacks-user.js.git "${SCRIPT_PATH}"/workdir/ghjs 2>/dev/null 1>&2
  }

  mkTweaks() {
      cp "${SCRIPT_PATH}"/*.js "${SCRIPT_PATH}"/workdir/ghjs

      echo "Applying userchrome tweaks..."
      case "${1}" in
          -m | --materialFox)
              cat "${SCRIPT_PATH}"/workdir/ghjs/materialfox.js >> "${SCRIPT_PATH}"/workdir/ghjs/user-overrides.js
              ;;
          -g | --gnome)
              cat "${SCRIPT_PATH}"/workdir/ghjs/gnome.js >> "${SCRIPT_PATH}"/workdir/ghjs/user-overrides.js
              ;;
          -n | --none)
              ;;
          -h | --help)
              echo -ne "\\nFirefox UserJS helper:
                                   -g, --gnome: apply GNOME userchrome theme
                                   -h, --help: display this message
                                   -m, --materialFox: apply MaterialFox userchrome theme
                                   -n, --none: no theme\\n"
              ;;
          ,*)
              echo -ne "\\nInvalid flag. Pass -h or --help for usage.\\n"
              exit 1
      esac

      echo "Merging tweaks with ghacks user.js..."
      "${SCRIPT_PATH}"/workdir/ghjs/updater.sh -s 2>/dev/null 1>&2
  }

  updateUserJS() {
      mkWorkDir
      fetchGHacksJS
      mkTweaks -n
  }

  applyUserJS() {
      profileList=$(cat "${SCRIPT_PATH}"/profiles.ini | grep -i 'Name' | cut -d '=' -f 2 | awk '{print tolower($0)}')

      for profile in ${profileList}; do
          echo "-> Copying user.js to profile: ${profile}..."
          cp "${SCRIPT_PATH}"/workdir/ghjs/user.js "${HOME}/.config/firefox/${profile}"
      done
  }

  createProfilesINIDir() {
      mkdir -p "${HOME}/.mozilla/firefox"
  }

  applyProfilesINI() {
      ln -sf "${SCRIPT_PATH}"/profiles.ini "${HOME}/.mozilla/firefox/"
  }

  createProfiles() {
      profileList=$(cat "${SCRIPT_PATH}"/profiles.ini | grep -i 'Name' | cut -d '=' -f 2 | awk '{print tolower($0)}')

      echo "Making profile directories..."
      for profile in ${profileList}; do
          mkdir -p "${HOME}/.config/firefox/${profile}"
      done
  }

  applyPolicies() {
      echo "Copying policies.json (may need root permissions)..."

      if [[ -d /usr/lib/firefox ]]; then
          sudo ln -sf "${SCRIPT_PATH}"/policies.json /usr/lib/firefox/distribution
      elif [[ -d /opt/firefox-nightly ]]; then
          sudo chown -R ${USER}:${USER} /opt/firefox-nightly
          ln -sf "${SCRIPT_PATH}"/policies.json /opt/firefox-nightly/distribution
      elif [[ -d /opt/firefox-developer-edition ]]; then
          ln -sf "${SCRIPT_PATH}"/policies.json /opt/firefox-developer-edition/distribution
      elif [[ -d /usr/lib/firefox-developer-edition ]]; then
          sudo ln -sf "${SCRIPT_PATH}"/policies.json /usr/lib/firefox-developer-edition/distribution
      fi
  }

  cleanUp() {
      echo "Cleaning up after myself..."
      rm -rf "${SCRIPT_PATH}"/workdir
  }

  startFirefox() {
      $(command -v firefox) --ProfileManager 2> /dev/null || \
      $(command -v firefox-developer-edition) --ProfileManager 2> /dev/null

      echo "Firefox is setup and started. Have a good day!"
  }
#+END_SRC
* Plasma
** Environment
#+BEGIN_SRC sh :tangle .config/plasma-workspace/env/askpass.sh :shebang "#!/usr/bin/env bash"
  export SSH_ASKPASS="$(command -v ksshaskpass)"
  export GIT_ASKPASS="$(command -v ksshaskpass)"
#+END_SRC
** PAM
#+BEGIN_SRC conf :tangle .pam_environment
  SSH_AUTH_SOCK DEFAULT="${XDG_RUNTIME_DIR}/ssh-agent.socket"
#+END_SRC
* Systemd
** SSH Agent
#+BEGIN_SRC conf :tangle .config/systemd/user/ssh-agent.service
  [Unit]
  Description=SSH key agent

  [Service]
  Type=simple
  Environment=SSH_AUTH_SOCK=%t/ssh-agent.socket
  ExecStart=/usr/bin/ssh-agent -D -a $SSH_AUTH_SOCK

  [Install]
  WantedBy=default.target
#+END_SRC
* Thunderbird
** Profiles
This reads the same as the profiles section of Firefox.
#+BEGIN_SRC ini :tangle .thunderbird/profiles.ini
  [General]
  StartWithLastProfile=1

  [Profile0]
  Name=Primary
  IsRelative=1
  Path=../.config/thunderbird/primary
  Default=1
#+END_SRC
* Ungoogled Chromium
** Environment Variables
From Debian bug tracker:
#+begin_quote
As can be seen in the upstream discussion, this happens whenever mesa
drivers are used since threads are used in their GLSL shader
implementation.  This does have a consequence, chromium's GPU driver
will not be sandboxed.  You can see this in about:gpu.

Also seen upstream, it should be possible to work around the problem
by setting MESA_GLSL_CACHE_DISABLE=true.

Best wishes,
Mike
#+end_quote

#+BEGIN_SRC text
  MESA_GLSL_CACHE_DISABLE=true
#+END_SRC
