README.md


<a id="orgc08d6b4"></a>

## Flags

A better explanation can be found [here](https://peter.sh/experiments/chromium-command-line-switches/).

    # Disable workarounds for various GPU driver bugs.
    # --disable-gpu-driver-bug-workarounds
    # Enable hardware acceleration
    --enable-accelerated-mjpeg-decode
    --enable-accelerated-video
    --enable-gpu-rasterization
    --enable-native-gpu-memory-buffers
    --enable-zero-copy
    --ignore-gpu-blacklist
    # Disables the crash reporting.
    --disable-breakpad
    # Disables cloud backup feature.
    --disable-cloud-import
    # Disables installation of default apps on first run. This is used during automated testing.
    --disable-default-apps
    # Disables the new Google favicon server for fetching favicons for Most Likely tiles on the New Tab Page.
    --disable-ntp-most-likely-favicons-from-server
    # Disables showing popular sites on the NTP.
    --disable-ntp-popular-sites
    # Disable auto-reload of error pages if offline.
    --disable-offline-auto-reload
    # Disables sign-in promo.
    --disable-signin-promo
    # The "disable" flag for kEnableSingleClickAutofill.
    --disable-single-click-autofill
    # Disables syncing browser data to a Google Account.
    --disable-sync
    # Disables the default browser check. Useful for UI/browser tests where we want to avoid having the default browser info-bar displayed.
    --no-default-browser-check
    # Don't send hyperlink auditing pings.
    --no-pings
    # Enable Dark Mode
    --force-dark-mode
    --enable-features=WebUIDarkMode


<a id="org98da626"></a>

# Utility

A crontab entry (as root, wherever needed) can be added to automate periodic builds / runs.

A few guidelines followed throughout these scripts:

-   Output is silenced and is replaced by friendly messages.
-   Errors are handled explicitly instead of letting the script fail.
-   Each task is divided into functions, no matter how small.
    The main function looks like nothing more than a series of steps (function calls).
-   Documentation for what the function does and why is provided.


<a id="org871cbff"></a>

## Ungoogled Chromium Extension Updater

-   `USER_DATA_DIR` is your data directory for Chromium.
    Normally, it is $HOME/.config/chromium. However since I
    sync my chromium profiles using Nextcloud and only use it
    for web applications; I like to keep it separated from the
    default installation.
-   `EXT_DIR` is the directory where extensions are stored.
-   `EXTID_LIST` is the list of all extensions you have
    installed currently. The list is fetched from the data
    directory, excluding the *Temp* directory.
-   `CHROMIUM_VERSION` fetches the major version of chromium
    that is installed.

For this function to work, you must set
`chrome://flags/#extension-mime-request-handling` to *Always
prompt for install* for automatic prompts. A truly
unattended way of updating extensions is not possible at
this moment.

    # import sanity
    set -euo pipefail
    
    # global declarations
    USER_DATA_DIR="${HOME}/.config/chromium/Apps"
    EXT_DIR="${USER_DATA_DIR}/Default/Extensions"
    EXTID_LIST=$(ls -1 "${EXT_DIR}" | grep -v Temp)
    CHROMIUM_VERSION=$($(command -v chromium) --version | grep -o '\s[0-9][0-9]\.[0-9]' | tr -d ' ')
    
    printDetails() {
        echo -e "Your Chromium version is ${CHROMIUM_VERSION}.\nYour profile is located at ${USER_DATA_DIR}."
    }
    
    checkForUpdate() {
        if [[ $((10#${1})) -gt $((10#${2})) ]]; then
            return 0
        else
            return 1
        fi
    }
    
    installExtension() {
        $(command -v chromium) --user-data-dir="${USER_DATA_DIR}" "${1}"
    }
    
    main() {
        printDetails
    
        for extID in ${EXTID_LIST}; do
            UPDATE_URL="https://clients2.google.com/service/update2/crx?response=redirect&acceptformat=crx2,crx3&prodversion=${CHROMIUM_VERSION}&x=id%3D${extID}%26installsource%3Dondemand%26uc"
    
            if [[ -n $(ls -1 "${EXT_DIR}/${extID}") ]]; then
                oldVersion=$(ls -1 "${EXT_DIR}/${extID}" | tail -1 | sed 's/\.//g; s/\_//g')
                newVersion=$(curl -s "${UPDATE_URL}" | grep --only extension_[0-9]*_[0-9]*_[0-9]*.*.crx | sed -e 's/extension_//g; s/\.crx//g; s/\.//g; s/\_//g')
    
                if checkForUpdate "${newVersion}" "${oldVersion}"; then
                    installExtension "${UPDATE_URL}"
                fi
            else
                installExtension "${UPDATE_URL}"
            fi
        done
    }
    
    main "${@}"


<a id="org250a418"></a>

## Virtual Desktop Bar (KDE)

-   `fetchSource` gets the latest master from github and
    places it in a subdirectory.
-   `installDeps` installs the missing dependencies required
    for building virtual desktop bar.
-   `buildTarget` executes a list of commands as mentioned on
    the github page for building the widget.
-   `installTarget` runs `make install` to copy the built
    target into the appropriate plasma directory.
-   Lastly, `cleanUp` removes the downloaded source.

    # import sanity
    set -euo pipefail
    
    # global declarations
    SCRIPT_PATH=$(dirname $(realpath "$0"))
    URL="https://github.com/wsdfhjxc/virtual-desktop-bar.git"
    
    fetchSource() {
        echo -e "Fetching source..."
        if git clone --quiet "${URL}" "${SCRIPT_PATH}"/virtual-desktop-bar; then
            echo -e "\t-> Source fetched successfully."
        else
            echo -e "\t-> Source couldn't be fetched."
        fi
    }
    
    installDeps() {
        echo -e "Installing dependencies (if any)..."
    
        if sudo pacman --sync --noconfirm --needed cmake extra-cmake-modules gcc 1> /dev/null 2>&1; then
            echo -e "\t-> Installed all required dependencies."
        else
            echo -e "\t-> All dependencies could not be installed!"
        fi
    }
    
    buildTarget() {
        cd "${SCRIPT_PATH}"/virtual-desktop-bar
        mkdir -p "${SCRIPT_PATH}"/virtual-desktop-bar/build
        cd "${SCRIPT_PATH}"/virtual-desktop-bar/build
    
        echo -e "Generating configuration..."
        if cmake "${SCRIPT_PATH}"/virtual-desktop-bar 1> /dev/null 2>&1; then
            echo -e "\t-> Configuration generated."
        else
            echo -e "\t-> Configuration generation failed!"
        fi
    
        echo -e "Building Virtual Desktop Bar..."
        if make -j$(nproc) 1> /dev/null; then
            echo -e "\t-> Building successful."
        else
            echo -e "\t-> Building failed!"
        fi
    }
    
    installTarget() {
        cd "${SCRIPT_PATH}"/virtual-desktop-bar/build
    
        echo -e "Installing target (need root permissions)..."
        if sudo make install 1> /dev/null 2>&1; then
            echo -e "\t-> Installing successful."
        else
            echo -e "\t-> Installing failed!"
        fi
    }
    
    cleanUp() {
        echo -e "Cleaning up all the cruft..."
        rm -rf "${SCRIPT_PATH}"/virtual-desktop-bar
    }
    
    main() {
        if [[ -d "${SCRIPT_PATH}"/virtual-desktop-bar ]]; then
            cleanUp
        fi
    
        fetchSource
        installDeps
        buildTarget
        installTarget
        cleanUp
    }
    
    main
