README.md


<a id="org716ddc3"></a>

## KWin Tiling Script (Faho)

Mostly the same as *Virtual Desktop Bar* sans the building.
The quirk here is to symlink a `.desktop` file for the gooey
configuration section to appear.

There is also an update step which is necessary if the
script has been previously installed.

    # import sanity
    set -euo pipefail
    
    # global declarations
    SCRIPT_PATH=$(dirname $(realpath "$0"))
    URL="https://github.com/kwin-scripts/kwin-tiling.git"
    
    fetchSource() {
        echo -e "Fetching source..."
        if git clone --quiet "${URL}" "${SCRIPT_PATH}"/kwin-tiling; then
            echo -e "\t-> Source fetched successfully."
        else
            echo -e "\t-> Source couldn't be fetched."
        fi
    }
    
    installScript() {
        echo -e "Installing KWin Tiling Script..."
        if plasmapkg2 --type kwinscript --install "${SCRIPT_PATH}"/kwin-tiling 1>/dev/null 2>&1; then
            echo -e "\t-> Installation successful."
        else
            echo -e "\t-> Installation failed!"
        fi
    }
    
    updateScript() {
        echo -e "Updating KWin Tiling Script..."
        if plasmapkg2 --type kwinscript --upgrade "${SCRIPT_PATH}"/kwin-tiling 1> /dev/null 2>&1; then
            echo -e "\t-> Update successful."
        else
            echo -e "\t-> Update failed!"
        fi
    }
    
    fixConf() {
        # necessary for configuration option in KWin Scripts menu
        mkdir -p "${HOME}"/.local/share/kservices5
        ln -sf "${HOME}"/.local/share/kwin/scripts/kwin-script-tiling/metadata.desktop "${HOME}"/.local/share/kservices5/kwin-script-tiling.desktop
    }
    
    cleanUp() {
        echo -e "Cleaning up all the cruft..."
        rm -rf "${SCRIPT_PATH}"/kwin-tiling
    }
    
    main() {
        if [[ -d "${SCRIPT_PATH}"/kwin-tiling ]]; then
            cleanUp
        fi
    
        fetchSource
        if [[ -d /home/kayg/.local/share/kwin/scripts/kwin-script-tiling ]]; then
            updateScript
        else
            installScript
        fi
    
        fixConf
        cleanUp
    }
    
    main


<a id="org8f623ea"></a>

## Wallpaper Index

Variables:

-   `WALL_STORAGE_PATH` holds the location where the indexed
    wallpapers are kept. Default value is
    `$HOME/Pictures/Wallpapers/Wallhaven` (expected to change in
    the future).
-   `WALL_TEMP_PATH` holds the location where the wallpapers
    are downloaded or wherever they are kept unorganized.
    Default value is $HOME/Downloads.

Functions:

-   `changeWallStoragePath` prompts for a new location for
    `WALL_STORAGE_PATH` and proceeds normally if
    
    -   the response is any of &ldquo;y&rdquo;, &ldquo;Y&rdquo;, &ldquo;yes&rdquo;, &ldquo;YES&rdquo;, etc and the entered path exists
    -   the response is any of &ldquo;n&rdquo;, &ldquo;N&rdquo;, &ldquo;no&rdquo;, &ldquo;NO&rdquo;, etc
    
    In case of an invalid response, the prompt is shown again.
-   `changeWallTempPath` is exactly the same as
    `changeWallStoragePath` but for `WALL_TEMP_PATH`.
-   `rename` does the following:
    -   reads the last index from `WALL_STORAGE_PATH` and
        wallpaper list from `WALL_TEMP_PATH`
    -   runs through the list of wallpapers, separates extension
        from name in order to preserve it in the renamed file
    -   renames files with a message saying so
    -   updates the index after each rename
-   `main`, unless either of &ldquo;-s&rdquo; or &ldquo;&#x2013;silent&rdquo; is passed,
    proceeds to invoke all functions.

    # import sanity
    set -euo pipefail
    
    # global declarations
    SCRIPT_PATH=$(dirname $(realpath "$0"))
    WALL_STORAGE_PATH="${HOME}/Pictures/Wallpapers/Wallhaven"
    WALL_TEMP_PATH="${HOME}/Downloads"
    
    changeWallStoragePath() {
        while true; do
            echo -ne "Wallpapers storage path is currently set to ${WALL_STORAGE_PATH}. Do you want to change it? "
            read -r resp
    
            echo
            case "${resp}" in
                [yY]|[yY][eE][Ss])
                    echo -ne "Please enter a path for wallpaper storage: "
                    read -r WALL_STORAGE_PATH
    
                    echo
                    if [[ ! -d "${WALL_STORAGE_PATH}" ]]; then
                        echo "You've entered a path that does not exist."
                        continue
                    else
                        break
                    fi
                    ;;
                [nN]|[nN][oO])
                    break
                    ;;
                *)
                    echo -e "Invalid response."
                    continue
            esac
        done
    }
    
    changeWallTempPath() {
        while true; do
            echo -ne "Wallpapers temporary storage path is currently set to ${WALL_TEMP_PATH}. Do you want to change it? "
            read -r resp
    
            echo
            case "${resp}" in
                [yY]|[yY][eE][Ss])
                    echo -ne "Please enter a path for wallpaper storage: "
                    read -r WALL_TEMP_PATH
    
                    echo
                    if [[ ! -d "${WALL_TEMP_PATH}" ]]; then
                        echo "You've entered a path that does not exist."
                        continue
                    else
                        break
                    fi
                    ;;
                [nN]|[nN][oO])
                    break
                    ;;
                *)
                    echo -e "Invalid response."
                    continue
            esac
        done
    }
    
    rename() {
        lastIndex=$(ls -1 --sort=version "${WALL_STORAGE_PATH}" | grep -E '^[0-9]+\.[a-z]+$' | tail -1 | cut -d '.' -f1)
        wallList=$(ls -1 --sort=time "${WALL_TEMP_PATH}" | grep -E '^[wW]allhaven.*')
    
        echo -e "Renaming wallpapers..."
        for wall in ${wallList}; do
            ext=$(echo "${wall}" | cut -d '.' -f2)
            if mv "${WALL_TEMP_PATH}/${wall}" "${WALL_STORAGE_PATH}/$((lastIndex + 1)).${ext}"; then
                echo -e "${WALL_TEMP_PATH}/${wall} has been renamed to ${WALL_STORAGE_PATH}/$((lastIndex + 1)).${ext}"
            else
                echo -e "File ${WALL_TEMP_PATH}/${wall} could not be renamed."
                exit 1
            fi
    
            lastIndex="$((lastIndex + 1))"
        done
    }
    
    main() {
        set +u
        case "${1}" in
            "-s"|"--silent")
                rename 1>/dev/null 2>&1
                ;;
        esac
        set -u
    
        changeWallStoragePath
        changeWallTempPath
        rename
    }
    
    main


<a id="org6833df4"></a>

# VSCodium

I tried VSCodium for a brief period of time but the fact
that a completely keyboard driven workflow cannot be
achieved with ease bothers me a lot. Don&rsquo;t get me wrong, the
autocompletion and the learning curve are simply amazing but
there&rsquo;s no other reason to choose VSCodium over something as
mature as Emacs.
